# W4111 - Introduction to Databases: Lecture 5 Exampls

## Environment Setup

In [6]:
import pandas

In [42]:
import sqlalchemy
from sqlalchemy import create_engine, text

In [8]:
import pymysql

In [9]:
import json

In [10]:
db_url = "mysql+pymysql://root:dbuserdbuser@localhost"

In [11]:
%load_ext sql

The sql extension is already loaded. To reload it, use:
  %reload_ext sql

In [126]:
%sql $db_url

In [127]:
# This is a hack to fix a version problem/incompatibility  with some of the packages and magics.
#
%config SqlMagic.style = '_DEPRECATED_DEFAULT'

In [13]:
engine = sqlalchemy.create_engine("mysql+pymysql://root:dbuserdbuser@localhost")

In [15]:
connection = pymysql.connect(
    host="localhost",
    port=3306,
    user="root",
    password="dbuserdbuser",
    cursorclass=pymysql.cursors.DictCursor,
    autocommit=True
)

In [16]:
import json

## Examine Some of This

In [17]:
type(connection)

pymysql.connections.Connection

In [19]:
dir(connection)

['DataError',
 'DatabaseError',
 'Error',
 'IntegrityError',
 'InterfaceError',
 'InternalError',
 'NotSupportedError',
 'OperationalError',
 'ProgrammingError',
 'Warning',
 '__class__',
 '__del__',
 '__delattr__',
 '__dict__',
 '__dir__',
 '__doc__',
 '__enter__',
 '__eq__',
 '__exit__',
 '__format__',
 '__ge__',
 '__getattribute__',
 '__getstate__',
 '__gt__',
 '__hash__',
 '__init__',
 '__init_subclass__',
 '__le__',
 '__lt__',
 '__module__',
 '__ne__',
 '__new__',
 '__reduce__',
 '__reduce_ex__',
 '__repr__',
 '__setattr__',
 '__sizeof__',
 '__str__',
 '__subclasshook__',
 '__weakref__',
 '_affected_rows',
 '_auth_plugin_map',
 '_auth_plugin_name',
 '_binary_prefix',
 '_closed',
 '_connect_attrs',
 '_create_ssl_ctx',
 '_execute_command',
 '_force_close',
 '_get_auth_plugin_handler',
 '_get_server_information',
 '_local_infile',
 '_next_seq_id',
 '_process_auth',
 '_quote_bytes',
 '_read_bytes',
 '_read_ok_packet',
 '_read_packet',
 '_read_query_result',
 '_read_timeout',
 '_request_authentication',
 '_result',
 '_rfile',
 '_secure',
 '_send_autocommit_mode',
 '_sock',
 '_write_bytes',
 '_write_timeout',
 'affected_rows',
 'autocommit',
 'autocommit_mode',
 'begin',
 'bind_address',
 'character_set_name',
 'charset',
 'client_flag',
 'close',
 'collation',
 'commit',
 'connect',
 'connect_timeout',
 'cursor',
 'cursorclass',
 'db',
 'decoders',
 'encoders',
 'encoding',
 'escape',
 'escape_string',
 'get_autocommit',
 'get_host_info',
 'get_proto_info',
 'get_server_info',
 'host',
 'host_info',
 'init_command',
 'insert_id',
 'kill',
 'literal',
 'max_allowed_packet',
 'next_result',
 'open',
 'password',
 'ping',
 'port',
 'protocol_version',
 'query',
 'rollback',
 'salt',
 'select_db',
 'server_capabilities',
 'server_charset',
 'server_language',
 'server_public_key',
 'server_status',
 'server_thread_id',
 'server_version',
 'set_character_set',
 'set_charset',
 'show_warnings',
 'sql_mode',
 'ssl',
 'thread_id',
 'unix_socket',
 'use_unicode',
 'user',
 'write_packet']

In [22]:
connection.charset

'utf8mb4'

"UTF-8 is a character encoding standard used for electronic communication. Defined by the Unicode Standard, ... ..."

"Character encoding is the process of assigning numbers to graphical characters, especially the written characters of human language, allowing them to be stored, transmitted, and transformed using computers."

"Collation is the assembly of written information into a standard order." -- Basically the sort order of characters in a character set.

In [24]:
s1 = "â¤ï¸"
s2 = "ðŸ˜š"

In [25]:
s1 > s2

False

In [27]:
"7".encode()

b'7'

In [28]:
s1.encode()

b'\xe2\x9d\xa4\xef\xb8\x8f'

In [58]:
%sql select * from mysql.user

 * mysql+pymysql://root:***@localhost
4 rows affected.

[('localhost', 'mysql.infoschema', 'Y', 'N', 'N', 'N', 'N', 'N', 'N', 'N', 'N', 'N', 'N', 'N', 'N', 'N', 'N', 'N', 'N', 'N', 'N', 'N', 'N', 'N', 'N', 'N', 'N', 'N', 'N', 'N', 'N', '', b'', b'', b'', 0, 0, 0, 0, 'caching_sha2_password', '$A$005$THISISACOMBINATIONOFINVALIDSALTANDPASSWORDTHATMUSTNEVERBRBEUSED', 'N', datetime.datetime(2024, 8, 10, 6, 4, 58), None, 'Y', 'N', 'N', None, None, None, None),
 ('localhost', 'mysql.session', 'N', 'N', 'N', 'N', 'N', 'N', 'N', 'Y', 'N', 'N', 'N', 'N', 'N', 'N', 'N', 'Y', 'N', 'N', 'N', 'N', 'N', 'N', 'N', 'N', 'N', 'N', 'N', 'N', 'N', '', b'', b'', b'', 0, 0, 0, 0, 'caching_sha2_password', '$A$005$THISISACOMBINATIONOFINVALIDSALTANDPASSWORDTHATMUSTNEVERBRBEUSED', 'N', datetime.datetime(2024, 8, 10, 6, 4, 58), None, 'Y', 'N', 'N', None, None, None, None),
 ('localhost', 'mysql.sys', 'N', 'N', 'N', 'N', 'N', 'N', 'N', 'N', 'N', 'N', 'N', 'N', 'N', 'N', 'N', 'N', 'N', 'N', 'N', 'N', 'N', 'N', 'N', 'N', 'N', 'N', 'N', 'N', 'N', '', b'', b'', b'', 0, 0, 0, 0, 'caching_sha2_password', '$A$005$THISISACOMBINATIONOFINVALIDSALTANDPASSWORDTHATMUSTNEVERBRBEUSED', 'N', datetime.datetime(2024, 8, 10, 6, 4, 58), None, 'Y', 'N', 'N', None, None, None, None),
 ('localhost', 'root', 'Y', 'Y', 'Y', 'Y', 'Y', 'Y', 'Y', 'Y', 'Y', 'Y', 'Y', 'Y', 'Y', 'Y', 'Y', 'Y', 'Y', 'Y', 'Y', 'Y', 'Y', 'Y', 'Y', 'Y', 'Y', 'Y', 'Y', 'Y', 'Y', '', b'', b'', b'', 0, 0, 0, 0, 'mysql_native_password', '*5F9114C7BDF19C3506AB4F79EE12BAB0AFB99A90', 'N', datetime.datetime(2024, 8, 10, 6, 5), None, 'N', 'Y', 'Y', None, None, None, None)]

## Information Schema

__Note:__ Commands you have seen me use like ```describe``` and ```show``` are "helpers" for more complex queries.

In [59]:
%sql show tables from db_book

 * mysql+pymysql://root:***@localhost
12 rows affected.

[('advisor',),
 ('classroom',),
 ('course',),
 ('department',),
 ('instructor',),
 ('instructor_public',),
 ('prereq',),
 ('section',),
 ('student',),
 ('takes',),
 ('teaches',),
 ('time_slot',)]

In [60]:
%sql describe db_book.student

 * mysql+pymysql://root:***@localhost
4 rows affected.

[('ID', 'varchar(5)', 'NO', 'PRI', None, ''),
 ('name', 'varchar(20)', 'NO', '', None, ''),
 ('dept_name', 'varchar(20)', 'YES', 'MUL', None, ''),
 ('tot_cred', 'decimal(3,0)', 'YES', '', None, '')]

The underlying queries are a lot more complicated.

In [61]:
%sql use information_schema

 * mysql+pymysql://root:***@localhost
0 rows affected.

[]

In [62]:
%%sql

select * from
    information_schema.columns
where
    table_schema="db_book" and table_name="student";

 * mysql+pymysql://root:***@localhost
4 rows affected.

[('def', 'db_book', 'student', 'ID', 1, None, 'NO', 'varchar', 5, 20, None, None, None, 'utf8mb4', 'utf8mb4_0900_ai_ci', 'varchar(5)', 'PRI', '', 'select,insert,update,references', '', '', None),
 ('def', 'db_book', 'student', 'name', 2, None, 'NO', 'varchar', 20, 80, None, None, None, 'utf8mb4', 'utf8mb4_0900_ai_ci', 'varchar(20)', '', '', 'select,insert,update,references', '', '', None),
 ('def', 'db_book', 'student', 'dept_name', 3, None, 'YES', 'varchar', 20, 80, None, None, None, 'utf8mb4', 'utf8mb4_0900_ai_ci', 'varchar(20)', 'MUL', '', 'select,insert,update,references', '', '', None),
 ('def', 'db_book', 'student', 'tot_cred', 4, None, 'YES', 'decimal', None, None, 3, 0, None, None, None, 'decimal(3,0)', '', '', 'select,insert,update,references', '', '', None)]

## Inheritance Example

I am going to make a copy of the data.

In [63]:
%%sql

drop table if exists s2025_examples.student;
create table s2025_examples.student like db_book.student;

drop table if exists s2025_examples.instructor;
create table s2025_examples.instructor like db_book.instructor;

insert into s2025_examples.student select * from db_book.student;
insert into s2025_examples.instructor select * from db_book.instructor;

 * mysql+pymysql://root:***@localhost
0 rows affected.
0 rows affected.
0 rows affected.
0 rows affected.
13 rows affected.
12 rows affected.

[]

In [64]:
%sql use s2025_examples;

 * mysql+pymysql://root:***@localhost
0 rows affected.

[]

In [65]:
%sql select * from student;

 * mysql+pymysql://root:***@localhost
13 rows affected.

[('00128', 'Zhang', 'Comp. Sci.', Decimal('102')),
 ('12345', 'Shankar', 'Comp. Sci.', Decimal('32')),
 ('19991', 'Brandt', 'History', Decimal('80')),
 ('23121', 'Chavez', 'Finance', Decimal('110')),
 ('44553', 'Peltier', 'Physics', Decimal('56')),
 ('45678', 'Levy', 'Physics', Decimal('46')),
 ('54321', 'Williams', 'Comp. Sci.', Decimal('54')),
 ('55739', 'Sanchez', 'Music', Decimal('38')),
 ('70557', 'Snow', 'Physics', Decimal('0')),
 ('76543', 'Brown', 'Comp. Sci.', Decimal('58')),
 ('76653', 'Aoi', 'Elec. Eng.', Decimal('60')),
 ('98765', 'Bourikas', 'Elec. Eng.', Decimal('98')),
 ('98988', 'Tanaka', 'Biology', Decimal('120'))]

In [66]:
%sql select * from instructor;

 * mysql+pymysql://root:***@localhost
12 rows affected.

[('10101', 'Srinivasan', 'Comp. Sci.', Decimal('65000.00')),
 ('12121', 'Wu', 'Finance', Decimal('90000.00')),
 ('15151', 'Mozart', 'Music', Decimal('40000.00')),
 ('22222', 'Einstein', 'Physics', Decimal('95000.00')),
 ('32343', 'El Said', 'History', Decimal('60000.00')),
 ('33456', 'Gold', 'Physics', Decimal('87000.00')),
 ('45565', 'Katz', 'Comp. Sci.', Decimal('75000.00')),
 ('58583', 'Califieri', 'History', Decimal('62000.00')),
 ('76543', 'Singh', 'Finance', Decimal('80000.00')),
 ('76766', 'Crick', 'Biology', Decimal('72000.00')),
 ('83821', 'Brandt', 'Comp. Sci.', Decimal('92000.00')),
 ('98345', 'Kim', 'Elec. Eng.', Decimal('80000.00'))]

Use the two-table, one view implementation.

In [71]:
%%sql

create or replace view person as
    select ID, name, dept_name, tot_cred, NULL as salary from student
union
    select ID, name, dept_name, NULL as tot_cred, salary from instructor;

 * mysql+pymysql://root:***@localhost
0 rows affected.

[]

In [72]:
%sql select * from person;

 * mysql+pymysql://root:***@localhost
25 rows affected.

[('00128', 'Zhang', 'Comp. Sci.', Decimal('102'), None),
 ('12345', 'Shankar', 'Comp. Sci.', Decimal('32'), None),
 ('19991', 'Brandt', 'History', Decimal('80'), None),
 ('23121', 'Chavez', 'Finance', Decimal('110'), None),
 ('44553', 'Peltier', 'Physics', Decimal('56'), None),
 ('45678', 'Levy', 'Physics', Decimal('46'), None),
 ('54321', 'Williams', 'Comp. Sci.', Decimal('54'), None),
 ('55739', 'Sanchez', 'Music', Decimal('38'), None),
 ('70557', 'Snow', 'Physics', Decimal('0'), None),
 ('76543', 'Brown', 'Comp. Sci.', Decimal('58'), None),
 ('76653', 'Aoi', 'Elec. Eng.', Decimal('60'), None),
 ('98765', 'Bourikas', 'Elec. Eng.', Decimal('98'), None),
 ('98988', 'Tanaka', 'Biology', Decimal('120'), None),
 ('10101', 'Srinivasan', 'Comp. Sci.', None, Decimal('65000.00')),
 ('12121', 'Wu', 'Finance', None, Decimal('90000.00')),
 ('15151', 'Mozart', 'Music', None, Decimal('40000.00')),
 ('22222', 'Einstein', 'Physics', None, Decimal('95000.00')),
 ('32343', 'El Said', 'History', None, Decimal('60000.00')),
 ('33456', 'Gold', 'Physics', None, Decimal('87000.00')),
 ('45565', 'Katz', 'Comp. Sci.', None, Decimal('75000.00')),
 ('58583', 'Califieri', 'History', None, Decimal('62000.00')),
 ('76543', 'Singh', 'Finance', None, Decimal('80000.00')),
 ('76766', 'Crick', 'Biology', None, Decimal('72000.00')),
 ('83821', 'Brandt', 'Comp. Sci.', None, Decimal('92000.00')),
 ('98345', 'Kim', 'Elec. Eng.', None, Decimal('80000.00'))]

INSERT will not work on this view. I cannot specify the underlying table.

UPDATE should work.

In [73]:
%%sql

update person
    set name="Used to be Zhang"
where
    ID = "00128";

 * mysql+pymysql://root:***@localhost
(pymysql.err.OperationalError) (1288, 'The target table person of the UPDATE is not updatable')
[SQL: update person
    set name="Used to be Zhang"
where
    ID = "00128";]
(Background on this error at: https://sqlalche.me/e/20/e3q8)

Oh well, that could have worked. It is theoretically possible to update the view because the ```WHERE``` there is no ambiguity for this specific row. I guess the free version of MySQL breaks the rules.

But, in general this table __is not__ updateable.
- How would ```INSERT``` work? The DBMS cannot determine the table. There are two underlying tables.
- Just because ```ID``` is a primary key in each of the underlying tables, it does not mean it is a primary key in the view. 


How can I handle problems like this? The answer will be FUNCTIONS and PROCEDURES, which we will see later.

## Indexes

In [75]:
%sql show indexes from f24_imdb_raw.name_basics

 * mysql+pymysql://root:***@localhost
0 rows affected.

[]

In [76]:
%sql show indexes from f24_imdb_clean.name_basics

 * mysql+pymysql://root:***@localhost
1 rows affected.

[('name_basics', 0, 'PRIMARY', 1, 'nconst', 'A', 13692675, None, None, '', 'BTREE', '', '', 'YES', None)]

In [77]:
loop_count = 10

In [78]:
sql = "select * from f24_imdb_raw.name_basics where nconst='nm9993717'"

In [79]:
from time import time

In [80]:
start_time = time()

for i in range(0, loop_count):
    result = %sql $sql

end_time = time()

result

 * mysql+pymysql://root:***@localhost
1 rows affected.
 * mysql+pymysql://root:***@localhost
1 rows affected.
 * mysql+pymysql://root:***@localhost
1 rows affected.
 * mysql+pymysql://root:***@localhost
1 rows affected.
 * mysql+pymysql://root:***@localhost
1 rows affected.
 * mysql+pymysql://root:***@localhost
1 rows affected.
 * mysql+pymysql://root:***@localhost
1 rows affected.
 * mysql+pymysql://root:***@localhost
1 rows affected.
 * mysql+pymysql://root:***@localhost
1 rows affected.
 * mysql+pymysql://root:***@localhost
1 rows affected.

[('nm9993717', 'Harikrishnan Rajan', None, None, 'cinematographer', 'tt8736744')]

In [82]:
print("Execution time without index = ", round(end_time-start_time, 2))

Execution time without index =  34.68

In [83]:
sql2 = "select * from f24_imdb_clean.name_basics where nconst='nm9993717'"

In [85]:
start_time = time()

for i in range(0, loop_count):
    result = %sql $sql2

end_time = time()

result

 * mysql+pymysql://root:***@localhost
1 rows affected.
 * mysql+pymysql://root:***@localhost
1 rows affected.
 * mysql+pymysql://root:***@localhost
1 rows affected.
 * mysql+pymysql://root:***@localhost
1 rows affected.
 * mysql+pymysql://root:***@localhost
1 rows affected.
 * mysql+pymysql://root:***@localhost
1 rows affected.
 * mysql+pymysql://root:***@localhost
1 rows affected.
 * mysql+pymysql://root:***@localhost
1 rows affected.
 * mysql+pymysql://root:***@localhost
1 rows affected.
 * mysql+pymysql://root:***@localhost
1 rows affected.

[('nm9993717', 'Harikrishnan Rajan', None, 'Harikrishnan', None, 'Rajan', None, None, None, None, 'tt8736744')]

In [86]:
print("Execution time WITH index = ", round(end_time-start_time, 2))

Execution time WITH index =  0.01

In [87]:
print("Indexes provide a speedup of", 34.68/0.01)

Indexes provide a speedup of 3468.0

## Putting Some Pieces Together

| <img src="one-table-two-view.jpg"> |
| :---: |
| __Logical Data Model__ |

In [115]:
%%sql

use s2025_examples;

drop table if exists s2025_examples.person_all;

create table if not exists s2025_examples.person_all
(
    UNI             varchar(12)                               not null
        primary key,
    person_type     enum ('S', 'I')                           null,
    first_name      varchar(64)                               not null,
    last_name       varchar(64)                               not null,
    preferred_email varchar(256)                              null,
    default_email   varchar(256) as (concat(`UNI`, _utf8mb4'@columbia.edu')) stored,
    school_code     varchar(4)                                null,
    degree_code     varchar(4)                                null,
    dept_code       varchar(4)                                null,
    title           enum ('Lecturer', 'Professor', 'Adjunct') null,
    constraint check_name
        check (
            (`person_type` = "S" and
             (`title` is null) and (`dept_code` is null) and (`school_code` is not null) and (`degree_code` is not null)
                )
                or
            (`person_type` = "I" and
             (`title` is not null) and (`dept_code` is not null) and (`school_code` is null) and
             (`degree_code` is null)
                )
            )
);

 * mysql+pymysql://root:***@localhost
0 rows affected.
0 rows affected.
0 rows affected.

[]

In [116]:
%%sql

alter table person_all
    add constraint person_all_unique_email
        unique (preferred_email);

 * mysql+pymysql://root:***@localhost
0 rows affected.

[]

In [117]:
%%sql

create or replace view student_view as
    select UNI, first_name, last_name, preferred_email, default_email, school_code, degree_code
    from person_all where person_type = "S";

create or replace view instructor_view as
    select UNI, first_name, last_name, preferred_email, default_email, dept_code, title
    from person_all where person_type = "I";

 * mysql+pymysql://root:***@localhost
0 rows affected.
0 rows affected.

[]

I want to "automate" generation of the ```UNI.```

I can do this with a function.

In [118]:
%%sql

use s2025_examples;

drop function if exists compute_uni;

create function compute_uni(first_name varchar(64), last_name varchar(64)) returns varchar(12)
deterministic
begin
    declare new_uni varchar(12);
    declare first_initial varchar(1);
    declare last_initial varchar(1);
    declare prefix varchar(3);
    declare prefix_count int;

    set first_initial = lower((select substr(first_name, 1, 1)));
    set last_initial = lower((select substr(last_name, 1, 1)));
    set prefix = concat(first_initial, last_initial, "%");

    select count(*) into prefix_count from person_all where uni like prefix;
    set new_uni = concat(first_initial, last_initial, prefix_count);
    return new_uni;
end;

 * mysql+pymysql://root:***@localhost
0 rows affected.
0 rows affected.
0 rows affected.

[]

In [119]:
%%sql

insert into person_all(uni, first_name, last_name, person_type, preferred_email, dept_code, title)
    values(
           compute_uni("Donald", "Ferguson"),
           "Donald", "Ferguson", "I", "dff@cs.columbia.edu", "COMS", "Adjunct"
          );

insert into person_all(uni, first_name, last_name, person_type, preferred_email, school_code, degree_code)
    values(
           compute_uni("Douglas", "Fairbanks"),
           "Douglas", "Fairbanks", "S", NULL, "SEAS", "MS"
          );

 * mysql+pymysql://root:***@localhost
1 rows affected.
1 rows affected.

[]

In [120]:
%sql select * from student_view;

 * mysql+pymysql://root:***@localhost
1 rows affected.

[('df1', 'Douglas', 'Fairbanks', None, 'df1@columbia.edu', 'SEAS', 'MS')]

In [121]:
%sql select * from instructor_view;

 * mysql+pymysql://root:***@localhost
1 rows affected.

[('df0', 'Donald', 'Ferguson', 'dff@cs.columbia.edu', 'df0@columbia.edu', 'COMS', 'Adjunct')]

I can do better than this and 1) Not rely on the user calling the function, 2) Make the ```UNI``` immutable.

In [122]:
%%sql

create trigger set_uni
    before insert
    on person_all
    for each row
begin
    set new.UNI = compute_uni(new.first_name, new.last_name);
end;

create trigger protect_uni
    before update
    on person_all
    for each row
begin
    if new.UNI is not NULL and (new.uni != old.uni) then
        SIGNAL SQLSTATE '50001'
            SET MESSAGE_TEXT = 'UNI is invariant.', MYSQL_ERRNO = 1234;
    end if;
end;

 * mysql+pymysql://root:***@localhost
0 rows affected.
0 rows affected.

[]

In [123]:
%%sql

insert into person_all(first_name, last_name, person_type, preferred_email, dept_code, title)
    values(
           "Donald", "Ferguson", "I", "don@cs.columbia.edu", "COMS", "Adjunct"
          );

insert into person_all(first_name, last_name, person_type, preferred_email, school_code, degree_code)
    values(
           "Douglas", "Fairbanks", "S", NULL, "SEAS", "MS"
          );

 * mysql+pymysql://root:***@localhost
1 rows affected.
1 rows affected.

[]

In [124]:
%sql select * from person_all;

 * mysql+pymysql://root:***@localhost
4 rows affected.

[('df0', 'I', 'Donald', 'Ferguson', 'dff@cs.columbia.edu', 'df0@columbia.edu', None, None, 'COMS', 'Adjunct'),
 ('df1', 'S', 'Douglas', 'Fairbanks', None, 'df1@columbia.edu', 'SEAS', 'MS', None, None),
 ('df2', 'I', 'Donald', 'Ferguson', 'don@cs.columbia.edu', 'df2@columbia.edu', None, None, 'COMS', 'Adjunct'),
 ('df3', 'S', 'Douglas', 'Fairbanks', None, 'df3@columbia.edu', 'SEAS', 'MS', None, None)]

## Let's Revisit View Update

In [129]:
%%sql
use s2025_examples;

insert into instructor_view(first_name, last_name, preferred_email, dept_code, title)
    values ("Doobie", "Fowser", "df2@a.com", "COMS", "Adjunct");

 * mysql+pymysql://root:***@localhost
0 rows affected.
1 rows affected.

[]

In [130]:
%sql select * from person_all;

 * mysql+pymysql://root:***@localhost
6 rows affected.

[('df0', 'I', 'Donald', 'Ferguson', 'dff@cs.columbia.edu', 'df0@columbia.edu', None, None, 'COMS', 'Adjunct'),
 ('df1', 'S', 'Douglas', 'Fairbanks', None, 'df1@columbia.edu', 'SEAS', 'MS', None, None),
 ('df2', 'I', 'Donald', 'Ferguson', 'don@cs.columbia.edu', 'df2@columbia.edu', None, None, 'COMS', 'Adjunct'),
 ('df3', 'S', 'Douglas', 'Fairbanks', None, 'df3@columbia.edu', 'SEAS', 'MS', None, None),
 ('df4', None, 'David', 'Finch', 'df@a.com', 'df4@columbia.edu', None, None, 'COMS', 'Adjunct'),
 ('df5', None, 'Doobie', 'Fowser', 'df2@a.com', 'df5@columbia.edu', None, None, 'COMS', 'Adjunct')]

- The ```UPDATE``` worked, but should not have. ```person_type`` should be ```NOT NULL.```

- But it would seem redundant to have to set the ```person_type``` when inserting into a table for which it is clear.

- Most databases only support triggers on __base tables.__ There really is not physical table for the view. You are basically trying to attach a trigger to an SQL statement.

- You can set a ```DEFAULT``` on a table column, but not on the column of the result set.